iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H747I-EVAL/stm32h747i_eval_audio.c
/* DFSDM Filter Msp config */
static void DFSDM_FilterMspInit(DFSDM_Filter_HandleTypeDef *hDfsdmFilter);
static void DFSDM_FilterMspDeInit(DFSDM_Filter_HandleTypeDef *hDfsdmFilter);

/* DFSDM Filter conversion callbacks */
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
static void DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
static void DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */

#if (USE_AUDIO_CODEC_WM8994 == 1)
static int32_t WM8994_Probe(void);
#endif
#if (USE_AUDIO_CODEC_ADV7533 == 1)
static int32_t ADV7533_Probe(void);
#endif

/**
  * @}
  */

/** @defgroup STM32H747I_EVAL_AUDIO_OUT_Private_Functions STM32H747I_EVAL_AUDIO_OUT Private Functions
  * @{
  */

/**
  * @brief  Configures the audio peripherals.
  * @param  Instance   AUDIO OUT Instance. It can only be 0 (SAI)
  * @param  AudioInit  AUDIO OUT init Structure
  * @retval BSP status
  */
int32_t BSP_AUDIO_OUT_Init(uint32_t Instance, BSP_AUDIO_Init_t* AudioInit)
{
 if(Instance >= AUDIO_OUT_INSTANCES_NBR)
 {
   return BSP_ERROR_WRONG_PARAM;
 }
 else
 {
   /* Fill Audio_Out_Ctx structure */
   Audio_Out_Ctx[Instance].Device         = AudioInit->Device;
   Audio_Out_Ctx[Instance].Instance       = Instance;
   Audio_Out_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
   Audio_Out_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
   Audio_Out_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
   Audio_Out_Ctx[Instance].Volume         = AudioInit->Volume;
   Audio_Out_Ctx[Instance].State          = AUDIO_OUT_STATE_RESET;

   if(AudioInit->Device != AUDIO_OUT_DEVICE_HDMI)
   {
#if (USE_AUDIO_CODEC_WM8994 == 1)
     if(WM8994_Probe() != BSP_ERROR_NONE)
     {
       return BSP_ERROR_COMPONENT_FAILURE;
     }
#endif
   }

   /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
   if(MX_SAI1_ClockConfig(&haudio_out_sai, AudioInit->SampleRate) != HAL_OK)
   {
     return BSP_ERROR_CLOCK_FAILURE;
   }
   /* SAI data transfer preparation:
   Prepare the Media to be used for the audio transfer from memory to SAI peripheral */
   haudio_out_sai.Instance = AUDIO_OUT_SAIx;

#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1U)
   /* Register the SAI MSP Callbacks */
   if(Audio_Out_Ctx[Instance].IsMspCallbacksValid == 0U)
   {
     if(BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
     {
       return BSP_ERROR_PERIPH_FAILURE;
     }
   }
#else
   SAI_MspInit(&haudio_out_sai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1U) */

   MX_SAI_Config mx_sai_config;

   /* Prepare haudio_out_sai handle */
   mx_sai_config.AudioFrequency    = AudioInit->SampleRate;
   mx_sai_config.AudioMode         = SAI_MODEMASTER_TX;
   mx_sai_config.ClockStrobing     = SAI_CLOCKSTROBING_RISINGEDGE;
   mx_sai_config.MonoStereoMode    = SAI_STEREOMODE;
   mx_sai_config.DataSize          = SAI_DATASIZE_16;
   mx_sai_config.FrameLength       = 128;
   mx_sai_config.ActiveFrameLength = 64;
   if (AudioInit->BitsPerSample == AUDIO_RESOLUTION_32B)
   {
     mx_sai_config.DataSize          = SAI_DATASIZE_32;
     mx_sai_config.FrameLength       = 128;
     mx_sai_config.ActiveFrameLength = 64;
   }
   if(AudioInit->ChannelsNbr == 1U)
   {
     mx_sai_config.MonoStereoMode = SAI_MONOMODE;
   }
   mx_sai_config.OutputDrive       = SAI_OUTPUTDRIVE_ENABLE;
   mx_sai_config.Synchro           = SAI_ASYNCHRONOUS;
   mx_sai_config.SynchroExt        = SAI_SYNCEXT_DISABLE;

   switch(AudioInit->Device)
   {
   case AUDIO_OUT_DEVICE_SPK_HP:
   case AUDIO_OUT_DEVICE_AUTO:
     mx_sai_config.SlotActive         = CODEC_AUDIOFRAME_SLOT_0123;
     break;
   case AUDIO_OUT_DEVICE_SPEAKER:
     mx_sai_config.SlotActive         = CODEC_AUDIOFRAME_SLOT_13;
     break;
   case AUDIO_OUT_DEVICE_HEADPHONE:
   default:
     mx_sai_config.SlotActive         = CODEC_AUDIOFRAME_SLOT_02;
     break;
   }

   /* SAI peripheral initialization: this __weak function can be redefined by the application  */
   if(MX_SAI1_Block_A_Init(&haudio_out_sai, &mx_sai_config) != HAL_OK)
   {
     return BSP_ERROR_PERIPH_FAILURE;
   }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1U)
   /* Register SAI TC, HT and Error callbacks */
   if(HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_COMPLETE_CB_ID, SAI_TxCpltCallback) != HAL_OK)
   {
     return BSP_ERROR_PERIPH_FAILURE;
   }
   if(HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_HALFCOMPLETE_CB_ID, SAI_TxHalfCpltCallback) != HAL_OK)
   {
     return BSP_ERROR_PERIPH_FAILURE;
   }
   if(HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
   {
     return BSP_ERROR_PERIPH_FAILURE;
   }
#endif


#if (USE_AUDIO_CODEC_WM8994 == 1)
   WM8994_Init_t codec_init;
   if(AudioInit->Device != AUDIO_OUT_DEVICE_HDMI)
   {
     switch (AudioInit->BitsPerSample)
     {
     case AUDIO_RESOLUTION_32B:
       codec_init.Resolution   = 3;
       break;

     case AUDIO_RESOLUTION_16B:
     default:
       codec_init.Resolution   = 0;
       break;
     }
     /* Fill codec_init structure */
     codec_init.Frequency    = AudioInit->SampleRate;
     codec_init.InputDevice  = WM8994_IN_NONE;
     codec_init.OutputDevice = AudioInit->Device;

     /* Convert volume before sending to the codec */
     codec_init.Volume       = VOLUME_OUT_CONVERT(AudioInit->Volume);

     /* Initialize the codec internal registers */
     if(Audio_Drv->Init(Audio_CompObj, &codec_init) != 0)
     {
       return BSP_ERROR_COMPONENT_FAILURE;
     }
   }
#endif
#if (USE_AUDIO_CODEC_ADV7533 == 1)
    if(ADV7533_Probe() == BSP_ERROR_NONE)
    {
      ADV7533_Init_t codec_init;

      /* Fill codec_init structure */
      codec_init.Frequency    = AudioInit->SampleRate;

      /* Initialize the codec internal registers */
      if(Audio_Drv->Init(Audio_CompObj, &codec_init) != 0)
      {
        return BSP_ERROR_COMPONENT_FAILURE;
      }
    }
#endif
    /* Update BSP AUDIO OUT state */
    Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_STOP;
  }

